&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	ЗаполнитьФормуГеолокации();
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьФормуГеолокации()
	
	НазваниеЛокации = "Локация";
	Адрес  			= "Адрес";
	
КонецПроцедуры


&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	
	ОповеститьОВыборе(Новый Структура("ИмяФормы,НазваниеЛокации,Адрес,Широта,Долгота", "ВыборГеолокации", НазваниеЛокации, Адрес, Широта, Долгота));
	
КонецПроцедуры
