&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	ЗаполнитьФормуКонтакта();
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьФормуКонтакта()
	
	Телефон  = Число("78087771122");
	Фамилия  = "Иванов";
	Имя      = "Иван";
	Отчество = "Иванович";   
	
	Компания = "Рога и Копыта";
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)  
	
	Закрыть(); 
	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	
	ОповеститьОВыборе(Новый Структура("ИмяФормы, chatID, Телефон, Имя, Фамилия, Отчество, Компания", "ВыборКонтакта",
		chatID, Телефон, Имя, Фамилия, Отчество, Компания));
	
КонецПроцедуры
